#include "ZeroFour.h"
#include "BackGround.h"

//=============================================================================
// コンソール
//=============================================================================
BackGround::BackGround()
{}

//=============================================================================
// デストラクタ
//=============================================================================
BackGround::~BackGround()
{
	BackGround();
}

//=============================================================================
// 初期化
//=============================================================================
bool BackGround::initialize(Graphics *graphics, TextureManager *textureM, int left,
							int top, float scale, COLOR_ARGB color)
{
	try {
		Image::initialize(graphics, bakgroundNS::IMAGE_SIZE, bakgroundNS::IMAGE_SIZE, bakgroundNS::TEXTURE_COLS, textureM);
		setCurrentFrame(bakgroundNS::BAR_FRAME);
		spriteData.x = (float)left;
		spriteData.y = (float)top;
		spriteData.scale = scale;
	}
	catch(...)
	{
		return false;
	}
	//return okay
	return true;
}

//=============================================================================
// アップデート
//=============================================================================
void BackGround::update()
{}

//=============================================================================
// 人工知能
//=============================================================================
void BackGround::ai()
{}

//=============================================================================
// 当たり判定
//=============================================================================
void BackGround::collisions()
{}

//=============================================================================
// 描画
//=============================================================================
void BackGround::render()
{
	//graphics->spriteBegin();//スプライトの描画を開始

	bgcitytex.draw();

	//graphics->spriteEnd();//スプライトの描画を終わる

}

//=============================================================================
// リリース
//=============================================================================
//void BackGround::releaseAll()
//{
//	bg_city_Texture.onLostDevice();
//	//Game::releaseAll();
//	return;
//}
//
////=============================================================================
//// リセット
////=============================================================================
//void BackGround::resetAll()
//{
//	bg_city_Texture.onResetDevice();
//	//Game::resetAll();
//	return;
//}
