#include "gameMain.h"
#include "BackGround.h"

//=============================================================================
// コンソール
//=============================================================================
BackGround::BackGround()
{}

//=============================================================================
// デストラクタ
//=============================================================================
BackGround::~BackGround()
{
	BackGround();
}

//=============================================================================
// 初期化
//=============================================================================
void BackGround::initialize()
{
	 // menu texture
    if (!bg_city_Texture.initialize(graphics,BACKGROUND_CITY_IMAGE))
        throw(GameError(gameErrorNS::FATAL_ERROR, "Error initializing menu texture"));
    // menu image
    if (!bgcitytex.initialize(graphics,0,0,0,&bg_city_Texture))
        throw(GameError(gameErrorNS::FATAL_ERROR, "Error initializing menu"));

}

//=============================================================================
// アップデート
//=============================================================================
void BackGround::update()
{}

//=============================================================================
// 描画
//=============================================================================
void BackGround::render()
{
	//graphics->spriteBegin();//スプライトの描画を開始

	bgcitytex.draw();

	//graphics->spriteEnd();//スプライトの描画を終わる

}

//=============================================================================
// リリース
//=============================================================================
void BackGround::releaseAll()
{
	bg_city_Texture.onLostDevice();
	//Game::releaseAll();
	return;
}

//=============================================================================
// リセット
//=============================================================================
void BackGround::resetAll()
{
	bg_city_Texture.onResetDevice();
	//Game::resetAll();
	return;
}
